[
  {
    "id": "iosc_001_0",
    "title": "IoSC-EDC Overview",
    "content": "The IoSC is a community full of people who love technology oriented towards innovative development in various fields-from design, system integration, game development, robotics, web, management, etc-and build a platform through which they will learn, try their hands-on experience, and excel",
    "category": "about",
    "tags": [
      "IoSC",
      "technology",
      "innovation",
      "education",
      "community",
      "mission"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "overview",
      "content_type": "text/plain"
    },
    "full_content": "The IoSC is a community full of people who love technology oriented towards innovative development in various fields-from design, system integration, game development, robotics, web, management, etc-and build a platform through which they will learn, try their hands-on experience, and excel. Our mission is to bring hands-on education based on collaboration and real-life problem-solving through workshops, hackathons, coding competitions, and networking sessions. With those, we equip our own with contemporary skills and industry insight.",
    "searchable_text": "IoSC-EDC Overview The IoSC is a community full of people who love technology oriented towards innovative development in various fields-from design, system integration, game development, robotics, web, management, etc-and build a platform through which they will learn, try their hands-on experience, and excel IoSC technology innovation education community mission about",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_001_1",
    "title": "IoSC-EDC Overview",
    "content": "Our mission is to bring hands-on education based on collaboration and real-life problem-solving through workshops, hackathons, coding competitions, and networking sessions. With those, we equip our own with contemporary skills and industry insight",
    "category": "about",
    "tags": [
      "IoSC",
      "technology",
      "innovation",
      "education",
      "community",
      "mission"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "overview",
      "content_type": "text/plain"
    },
    "full_content": "The IoSC is a community full of people who love technology oriented towards innovative development in various fields-from design, system integration, game development, robotics, web, management, etc-and build a platform through which they will learn, try their hands-on experience, and excel. Our mission is to bring hands-on education based on collaboration and real-life problem-solving through workshops, hackathons, coding competitions, and networking sessions. With those, we equip our own with contemporary skills and industry insight.",
    "searchable_text": "IoSC-EDC Overview Our mission is to bring hands-on education based on collaboration and real-life problem-solving through workshops, hackathons, coding competitions, and networking sessions. With those, we equip our own with contemporary skills and industry insight IoSC technology innovation education community mission about",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_002",
    "title": "IoSC Mentors",
    "content": "IoSC is guided by experienced mentors who provide guidance and support to the community. Our mentors include Dr. Rahul Johri and Dr. Khyati Chopra, who bring their expertise and knowledge to help students grow in their technical journey.",
    "category": "team",
    "tags": [
      "mentors",
      "Dr. Rahul Johri",
      "Dr. Khyati Chopra",
      "guidance",
      "faculty"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "mentors",
      "content_type": "text/plain"
    },
    "full_content": "IoSC is guided by experienced mentors who provide guidance and support to the community. Our mentors include Dr. Rahul Johri and Dr. Khyati Chopra, who bring their expertise and knowledge to help students grow in their technical journey.",
    "searchable_text": "IoSC Mentors IoSC is guided by experienced mentors who provide guidance and support to the community. Our mentors include Dr. Rahul Johri and Dr. Khyati Chopra, who bring their expertise and knowledge to help students grow in their technical journey. mentors Dr. Rahul Johri Dr. Khyati Chopra guidance faculty team",
    "chunk_index": 0,
    "total_chunks": 1
  },
  {
    "id": "iosc_003_0",
    "title": "IoSC Alumni",
    "content": "IoSC has a strong network of alumni who have contributed to the community's growth and continue to inspire current members. Our notable alumni include Aryan Khanna, Avinash Srivastava, Divyansh, and Siddharth Gupta",
    "category": "alumni",
    "tags": [
      "alumni",
      "Aryan Khanna",
      "Avinash Srivastava",
      "Divyansh",
      "Siddharth Gupta",
      "network"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "alumni",
      "content_type": "text/plain"
    },
    "full_content": "IoSC has a strong network of alumni who have contributed to the community's growth and continue to inspire current members. Our notable alumni include Aryan Khanna, Avinash Srivastava, Divyansh, and Siddharth Gupta. These alumni have gone on to achieve success in their respective fields and remain connected to the IoSC community.",
    "searchable_text": "IoSC Alumni IoSC has a strong network of alumni who have contributed to the community's growth and continue to inspire current members. Our notable alumni include Aryan Khanna, Avinash Srivastava, Divyansh, and Siddharth Gupta alumni Aryan Khanna Avinash Srivastava Divyansh Siddharth Gupta network alumni",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_003_1",
    "title": "IoSC Alumni",
    "content": "These alumni have gone on to achieve success in their respective fields and remain connected to the IoSC community",
    "category": "alumni",
    "tags": [
      "alumni",
      "Aryan Khanna",
      "Avinash Srivastava",
      "Divyansh",
      "Siddharth Gupta",
      "network"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "alumni",
      "content_type": "text/plain"
    },
    "full_content": "IoSC has a strong network of alumni who have contributed to the community's growth and continue to inspire current members. Our notable alumni include Aryan Khanna, Avinash Srivastava, Divyansh, and Siddharth Gupta. These alumni have gone on to achieve success in their respective fields and remain connected to the IoSC community.",
    "searchable_text": "IoSC Alumni These alumni have gone on to achieve success in their respective fields and remain connected to the IoSC community alumni Aryan Khanna Avinash Srivastava Divyansh Siddharth Gupta network alumni",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_004_0",
    "title": "IoSC Leadership Team",
    "content": "IoSC is led by a dedicated team of student leaders who drive the community's activities and initiatives. The leadership team includes Parth Awasthi as the Lead, Dipti Singh as Co-Lead, Jay Tomar as Technical Lead, Akshat Saraswat as Technical Co-Lead, and Ishan Gupta as Technical Co-Lead",
    "category": "team",
    "tags": [
      "leadership",
      "Parth Awasthi",
      "Dipti Singh",
      "Jay Tomar",
      "Akshat Saraswat",
      "Ishan Gupta",
      "student leaders"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "leadership",
      "content_type": "text/plain"
    },
    "full_content": "IoSC is led by a dedicated team of student leaders who drive the community's activities and initiatives. The leadership team includes Parth Awasthi as the Lead, Dipti Singh as Co-Lead, Jay Tomar as Technical Lead, Akshat Saraswat as Technical Co-Lead, and Ishan Gupta as Technical Co-Lead. These leaders coordinate various activities and ensure the smooth functioning of the community.",
    "searchable_text": "IoSC Leadership Team IoSC is led by a dedicated team of student leaders who drive the community's activities and initiatives. The leadership team includes Parth Awasthi as the Lead, Dipti Singh as Co-Lead, Jay Tomar as Technical Lead, Akshat Saraswat as Technical Co-Lead, and Ishan Gupta as Technical Co-Lead leadership Parth Awasthi Dipti Singh Jay Tomar Akshat Saraswat Ishan Gupta student leaders team",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_004_1",
    "title": "IoSC Leadership Team",
    "content": "These leaders coordinate various activities and ensure the smooth functioning of the community",
    "category": "team",
    "tags": [
      "leadership",
      "Parth Awasthi",
      "Dipti Singh",
      "Jay Tomar",
      "Akshat Saraswat",
      "Ishan Gupta",
      "student leaders"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "leadership",
      "content_type": "text/plain"
    },
    "full_content": "IoSC is led by a dedicated team of student leaders who drive the community's activities and initiatives. The leadership team includes Parth Awasthi as the Lead, Dipti Singh as Co-Lead, Jay Tomar as Technical Lead, Akshat Saraswat as Technical Co-Lead, and Ishan Gupta as Technical Co-Lead. These leaders coordinate various activities and ensure the smooth functioning of the community.",
    "searchable_text": "IoSC Leadership Team These leaders coordinate various activities and ensure the smooth functioning of the community leadership Parth Awasthi Dipti Singh Jay Tomar Akshat Saraswat Ishan Gupta student leaders team",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_005",
    "title": "Team I3 - Software Development Team",
    "content": "Team I3 is IoSC's Software Development Team, focusing on building software solutions and applications. The team members include Aryan Sachan, Karan Bhatt, Rahul Bhatt, and Mayank Bisht. This team works on various software development projects and helps members learn programming and development skills",
    "category": "team",
    "tags": [
      "Team I3",
      "software development",
      "Aryan Sachan",
      "Karan Bhatt",
      "Rahul Bhatt",
      "Mayank Bisht",
      "programming"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I3 is IoSC's Software Development Team, focusing on building software solutions and applications. The team members include Aryan Sachan, Karan Bhatt, Rahul Bhatt, and Mayank Bisht. This team works on various software development projects and helps members learn programming and development skills.",
    "searchable_text": "Team I3 - Software Development Team Team I3 is IoSC's Software Development Team, focusing on building software solutions and applications. The team members include Aryan Sachan, Karan Bhatt, Rahul Bhatt, and Mayank Bisht. This team works on various software development projects and helps members learn programming and development skills Team I3 software development Aryan Sachan Karan Bhatt Rahul Bhatt Mayank Bisht programming team",
    "chunk_index": 0,
    "total_chunks": 1
  },
  {
    "id": "iosc_006_0",
    "title": "Team I5 - IoT & Embedded Systems Team",
    "content": "Team I5 is IoSC's IoT & Embedded Systems Team, specializing in Internet of Things and embedded systems development. The team consists of Amogh Gupta, Mayank Sharma, Ocean Bhatnagar, Samarth Yadav, Pratham Kumar, Utsav Kumar, and Waqar Akhtar",
    "category": "team",
    "tags": [
      "Team I5",
      "IoT",
      "embedded systems",
      "Amogh Gupta",
      "Mayank Sharma",
      "Ocean Bhatnagar",
      "Samarth Yadav",
      "Pratham Kumar",
      "Utsav Kumar",
      "Waqar Akhtar"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I5 is IoSC's IoT & Embedded Systems Team, specializing in Internet of Things and embedded systems development. The team consists of Amogh Gupta, Mayank Sharma, Ocean Bhatnagar, Samarth Yadav, Pratham Kumar, Utsav Kumar, and Waqar Akhtar. This team focuses on hardware-software integration and IoT solutions.",
    "searchable_text": "Team I5 - IoT & Embedded Systems Team Team I5 is IoSC's IoT & Embedded Systems Team, specializing in Internet of Things and embedded systems development. The team consists of Amogh Gupta, Mayank Sharma, Ocean Bhatnagar, Samarth Yadav, Pratham Kumar, Utsav Kumar, and Waqar Akhtar Team I5 IoT embedded systems Amogh Gupta Mayank Sharma Ocean Bhatnagar Samarth Yadav Pratham Kumar Utsav Kumar Waqar Akhtar team",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_006_1",
    "title": "Team I5 - IoT & Embedded Systems Team",
    "content": "This team focuses on hardware-software integration and IoT solutions",
    "category": "team",
    "tags": [
      "Team I5",
      "IoT",
      "embedded systems",
      "Amogh Gupta",
      "Mayank Sharma",
      "Ocean Bhatnagar",
      "Samarth Yadav",
      "Pratham Kumar",
      "Utsav Kumar",
      "Waqar Akhtar"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I5 is IoSC's IoT & Embedded Systems Team, specializing in Internet of Things and embedded systems development. The team consists of Amogh Gupta, Mayank Sharma, Ocean Bhatnagar, Samarth Yadav, Pratham Kumar, Utsav Kumar, and Waqar Akhtar. This team focuses on hardware-software integration and IoT solutions.",
    "searchable_text": "Team I5 - IoT & Embedded Systems Team This team focuses on hardware-software integration and IoT solutions Team I5 IoT embedded systems Amogh Gupta Mayank Sharma Ocean Bhatnagar Samarth Yadav Pratham Kumar Utsav Kumar Waqar Akhtar team",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_007",
    "title": "Team I7 - Game Development Team",
    "content": "Team I7 is IoSC's Game Development Team, dedicated to creating games and interactive experiences. The team is currently represented by Akshit Sharma. This team focuses on game design, development, and exploring various gaming technologies and platforms.",
    "category": "team",
    "tags": [
      "Team I7",
      "game development",
      "Akshit Sharma",
      "gaming",
      "interactive experiences"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I7 is IoSC's Game Development Team, dedicated to creating games and interactive experiences. The team is currently represented by Akshit Sharma. This team focuses on game design, development, and exploring various gaming technologies and platforms.",
    "searchable_text": "Team I7 - Game Development Team Team I7 is IoSC's Game Development Team, dedicated to creating games and interactive experiences. The team is currently represented by Akshit Sharma. This team focuses on game design, development, and exploring various gaming technologies and platforms. Team I7 game development Akshit Sharma gaming interactive experiences team",
    "chunk_index": 0,
    "total_chunks": 1
  },
  {
    "id": "iosc_008_0",
    "title": "Team Arc - Design Team",
    "content": "Team Arc is IoSC's Design Team, responsible for creating visual designs, user interfaces, and creative content for the community. The team includes Khushi Thakur, Pari Dudeja, Kriti Rastogi, Alisha Godara, and Sanchit Narang",
    "category": "team",
    "tags": [
      "Team Arc",
      "design",
      "UI/UX",
      "Khushi Thakur",
      "Pari Dudeja",
      "Kriti Rastogi",
      "Alisha Godara",
      "Sanchit Narang",
      "graphics"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team Arc is IoSC's Design Team, responsible for creating visual designs, user interfaces, and creative content for the community. The team includes Khushi Thakur, Pari Dudeja, Kriti Rastogi, Alisha Godara, and Sanchit Narang. This team handles all design-related activities including UI/UX design, graphics, and visual communication.",
    "searchable_text": "Team Arc - Design Team Team Arc is IoSC's Design Team, responsible for creating visual designs, user interfaces, and creative content for the community. The team includes Khushi Thakur, Pari Dudeja, Kriti Rastogi, Alisha Godara, and Sanchit Narang Team Arc design UI/UX Khushi Thakur Pari Dudeja Kriti Rastogi Alisha Godara Sanchit Narang graphics team",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_008_1",
    "title": "Team Arc - Design Team",
    "content": "This team handles all design-related activities including UI/UX design, graphics, and visual communication",
    "category": "team",
    "tags": [
      "Team Arc",
      "design",
      "UI/UX",
      "Khushi Thakur",
      "Pari Dudeja",
      "Kriti Rastogi",
      "Alisha Godara",
      "Sanchit Narang",
      "graphics"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team Arc is IoSC's Design Team, responsible for creating visual designs, user interfaces, and creative content for the community. The team includes Khushi Thakur, Pari Dudeja, Kriti Rastogi, Alisha Godara, and Sanchit Narang. This team handles all design-related activities including UI/UX design, graphics, and visual communication.",
    "searchable_text": "Team Arc - Design Team This team handles all design-related activities including UI/UX design, graphics, and visual communication Team Arc design UI/UX Khushi Thakur Pari Dudeja Kriti Rastogi Alisha Godara Sanchit Narang graphics team",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_009_0",
    "title": "Team I9 - AI Development Team",
    "content": "Team I9 is IoSC's AI Development Team, focusing on artificial intelligence and machine learning projects. The team consists of Utkarsh Chauhan, Akshat Talwar, Drishti Sinha, Harshit Negi, Parth Mawai, Piyush Gupta, Priya Chaurasia, and Richik Das",
    "category": "team",
    "tags": [
      "Team I9",
      "AI",
      "machine learning",
      "Utkarsh Chauhan",
      "Akshat Talwar",
      "Drishti Sinha",
      "Harshit Negi",
      "Parth Mawai",
      "Piyush Gupta",
      "Priya Chaurasia",
      "Richik Das"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I9 is IoSC's AI Development Team, focusing on artificial intelligence and machine learning projects. The team consists of Utkarsh Chauhan, Akshat Talwar, Drishti Sinha, Harshit Negi, Parth Mawai, Piyush Gupta, Priya Chaurasia, and Richik Das. This team works on AI/ML applications, data science projects, and explores cutting-edge AI technologies.",
    "searchable_text": "Team I9 - AI Development Team Team I9 is IoSC's AI Development Team, focusing on artificial intelligence and machine learning projects. The team consists of Utkarsh Chauhan, Akshat Talwar, Drishti Sinha, Harshit Negi, Parth Mawai, Piyush Gupta, Priya Chaurasia, and Richik Das Team I9 AI machine learning Utkarsh Chauhan Akshat Talwar Drishti Sinha Harshit Negi Parth Mawai Piyush Gupta Priya Chaurasia Richik Das team",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_009_1",
    "title": "Team I9 - AI Development Team",
    "content": "This team works on AI/ML applications, data science projects, and explores cutting-edge AI technologies",
    "category": "team",
    "tags": [
      "Team I9",
      "AI",
      "machine learning",
      "Utkarsh Chauhan",
      "Akshat Talwar",
      "Drishti Sinha",
      "Harshit Negi",
      "Parth Mawai",
      "Piyush Gupta",
      "Priya Chaurasia",
      "Richik Das"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team I9 is IoSC's AI Development Team, focusing on artificial intelligence and machine learning projects. The team consists of Utkarsh Chauhan, Akshat Talwar, Drishti Sinha, Harshit Negi, Parth Mawai, Piyush Gupta, Priya Chaurasia, and Richik Das. This team works on AI/ML applications, data science projects, and explores cutting-edge AI technologies.",
    "searchable_text": "Team I9 - AI Development Team This team works on AI/ML applications, data science projects, and explores cutting-edge AI technologies Team I9 AI machine learning Utkarsh Chauhan Akshat Talwar Drishti Sinha Harshit Negi Parth Mawai Piyush Gupta Priya Chaurasia Richik Das team",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_010_0",
    "title": "Team Ultra - Management Team",
    "content": "Team Ultra is IoSC's Management Team, responsible for organizing events, managing operations, and coordinating various activities within the community. The team includes Yash Gupta, Vasu Tohanagar, Armaan, and Dipanshu Sarovar",
    "category": "team",
    "tags": [
      "Team Ultra",
      "management",
      "events",
      "Yash Gupta",
      "Vasu Tohanagar",
      "Armaan",
      "Dipanshu Sarovar",
      "operations"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team Ultra is IoSC's Management Team, responsible for organizing events, managing operations, and coordinating various activities within the community. The team includes Yash Gupta, Vasu Tohanagar, Armaan, and Dipanshu Sarovar. This team ensures smooth execution of events and manages the administrative aspects of IoSC.",
    "searchable_text": "Team Ultra - Management Team Team Ultra is IoSC's Management Team, responsible for organizing events, managing operations, and coordinating various activities within the community. The team includes Yash Gupta, Vasu Tohanagar, Armaan, and Dipanshu Sarovar Team Ultra management events Yash Gupta Vasu Tohanagar Armaan Dipanshu Sarovar operations team",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_010_1",
    "title": "Team Ultra - Management Team",
    "content": "This team ensures smooth execution of events and manages the administrative aspects of IoSC",
    "category": "team",
    "tags": [
      "Team Ultra",
      "management",
      "events",
      "Yash Gupta",
      "Vasu Tohanagar",
      "Armaan",
      "Dipanshu Sarovar",
      "operations"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "teams",
      "content_type": "text/plain"
    },
    "full_content": "Team Ultra is IoSC's Management Team, responsible for organizing events, managing operations, and coordinating various activities within the community. The team includes Yash Gupta, Vasu Tohanagar, Armaan, and Dipanshu Sarovar. This team ensures smooth execution of events and manages the administrative aspects of IoSC.",
    "searchable_text": "Team Ultra - Management Team This team ensures smooth execution of events and manages the administrative aspects of IoSC Team Ultra management events Yash Gupta Vasu Tohanagar Armaan Dipanshu Sarovar operations team",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_011_0",
    "title": "Hydro Heroes Project",
    "content": "Hydro Heroes is an IoSC project that focuses on water management and conservation. The project implements real-time flow tracking to predict leaks and includes quality monitoring features",
    "category": "projects",
    "tags": [
      "Hydro Heroes",
      "water management",
      "real-time tracking",
      "leak detection",
      "quality monitoring",
      "IoT"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "Hydro Heroes is an IoSC project that focuses on water management and conservation. The project implements real-time flow tracking to predict leaks and includes quality monitoring features. This project demonstrates IoSC's commitment to solving real-world problems through technology, specifically addressing water conservation and management challenges.",
    "searchable_text": "Hydro Heroes Project Hydro Heroes is an IoSC project that focuses on water management and conservation. The project implements real-time flow tracking to predict leaks and includes quality monitoring features Hydro Heroes water management real-time tracking leak detection quality monitoring IoT projects",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_011_1",
    "title": "Hydro Heroes Project",
    "content": "This project demonstrates IoSC's commitment to solving real-world problems through technology, specifically addressing water conservation and management challenges",
    "category": "projects",
    "tags": [
      "Hydro Heroes",
      "water management",
      "real-time tracking",
      "leak detection",
      "quality monitoring",
      "IoT"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "Hydro Heroes is an IoSC project that focuses on water management and conservation. The project implements real-time flow tracking to predict leaks and includes quality monitoring features. This project demonstrates IoSC's commitment to solving real-world problems through technology, specifically addressing water conservation and management challenges.",
    "searchable_text": "Hydro Heroes Project This project demonstrates IoSC's commitment to solving real-world problems through technology, specifically addressing water conservation and management challenges Hydro Heroes water management real-time tracking leak detection quality monitoring IoT projects",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_012_0",
    "title": "Quiz Play Project",
    "content": "Quiz Play is an interactive quiz application developed by IoSC members. The project allows users to take quizzes, view results, and manage quiz data through an intuitive user interface",
    "category": "projects",
    "tags": [
      "Quiz Play",
      "interactive",
      "quizzes",
      "web development",
      "educational",
      "UI",
      "assessment"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "Quiz Play is an interactive quiz application developed by IoSC members. The project allows users to take quizzes, view results, and manage quiz data through an intuitive user interface. This project showcases the team's web development skills and focuses on creating engaging educational tools for learning and assessment.",
    "searchable_text": "Quiz Play Project Quiz Play is an interactive quiz application developed by IoSC members. The project allows users to take quizzes, view results, and manage quiz data through an intuitive user interface Quiz Play interactive quizzes web development educational UI assessment projects",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_012_1",
    "title": "Quiz Play Project",
    "content": "This project showcases the team's web development skills and focuses on creating engaging educational tools for learning and assessment",
    "category": "projects",
    "tags": [
      "Quiz Play",
      "interactive",
      "quizzes",
      "web development",
      "educational",
      "UI",
      "assessment"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "Quiz Play is an interactive quiz application developed by IoSC members. The project allows users to take quizzes, view results, and manage quiz data through an intuitive user interface. This project showcases the team's web development skills and focuses on creating engaging educational tools for learning and assessment.",
    "searchable_text": "Quiz Play Project This project showcases the team's web development skills and focuses on creating engaging educational tools for learning and assessment Quiz Play interactive quizzes web development educational UI assessment projects",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_013_0",
    "title": "AI Code Review Project",
    "content": "AI Code Review is a full-stack AI-powered code review tool built with Node. js, React, and Google's Gemini API. This project demonstrates IoSC's expertise in artificial intelligence and full-stack development",
    "category": "projects",
    "tags": [
      "AI Code Review",
      "artificial intelligence",
      "Node.js",
      "React",
      "Gemini API",
      "full-stack",
      "code quality"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "AI Code Review is a full-stack AI-powered code review tool built with Node.js, React, and Google's Gemini API. This project demonstrates IoSC's expertise in artificial intelligence and full-stack development. The tool helps developers review code automatically using AI, improving code quality and development efficiency.",
    "searchable_text": "AI Code Review Project AI Code Review is a full-stack AI-powered code review tool built with Node. js, React, and Google's Gemini API. This project demonstrates IoSC's expertise in artificial intelligence and full-stack development AI Code Review artificial intelligence Node.js React Gemini API full-stack code quality projects",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_013_1",
    "title": "AI Code Review Project",
    "content": "The tool helps developers review code automatically using AI, improving code quality and development efficiency",
    "category": "projects",
    "tags": [
      "AI Code Review",
      "artificial intelligence",
      "Node.js",
      "React",
      "Gemini API",
      "full-stack",
      "code quality"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "AI Code Review is a full-stack AI-powered code review tool built with Node.js, React, and Google's Gemini API. This project demonstrates IoSC's expertise in artificial intelligence and full-stack development. The tool helps developers review code automatically using AI, improving code quality and development efficiency.",
    "searchable_text": "AI Code Review Project The tool helps developers review code automatically using AI, improving code quality and development efficiency AI Code Review artificial intelligence Node.js React Gemini API full-stack code quality projects",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_014_0",
    "title": "DriveEasy Project",
    "content": "DriveEasy is a MERN stack-based car rental platform developed by IoSC members. The platform enables users to easily browse, book, and manage vehicle rentals online. This project showcases full-stack web development skills using MongoDB, Express. js, React, and Node",
    "category": "projects",
    "tags": [
      "DriveEasy",
      "MERN stack",
      "car rental",
      "MongoDB",
      "Express.js",
      "React",
      "Node.js",
      "web application"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "DriveEasy is a MERN stack-based car rental platform developed by IoSC members. The platform enables users to easily browse, book, and manage vehicle rentals online. This project showcases full-stack web development skills using MongoDB, Express.js, React, and Node.js, demonstrating the team's capability in building complete web applications.",
    "searchable_text": "DriveEasy Project DriveEasy is a MERN stack-based car rental platform developed by IoSC members. The platform enables users to easily browse, book, and manage vehicle rentals online. This project showcases full-stack web development skills using MongoDB, Express. js, React, and Node DriveEasy MERN stack car rental MongoDB Express.js React Node.js web application projects",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_014_1",
    "title": "DriveEasy Project",
    "content": "js, demonstrating the team's capability in building complete web applications",
    "category": "projects",
    "tags": [
      "DriveEasy",
      "MERN stack",
      "car rental",
      "MongoDB",
      "Express.js",
      "React",
      "Node.js",
      "web application"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "projects",
      "content_type": "text/plain"
    },
    "full_content": "DriveEasy is a MERN stack-based car rental platform developed by IoSC members. The platform enables users to easily browse, book, and manage vehicle rentals online. This project showcases full-stack web development skills using MongoDB, Express.js, React, and Node.js, demonstrating the team's capability in building complete web applications.",
    "searchable_text": "DriveEasy Project js, demonstrating the team's capability in building complete web applications DriveEasy MERN stack car rental MongoDB Express.js React Node.js web application projects",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_015_0",
    "title": "React Boot Camp Event",
    "content": "IoSC's React Bootcamp was a hands-on learning experience where students dove into the world of modern web development. From building dynamic UIs to understanding React hooks and components, participants gained practical skills and built their very first React apps",
    "category": "events",
    "tags": [
      "React Bootcamp",
      "web development",
      "hands-on learning",
      "UI",
      "React hooks",
      "components",
      "practical skills"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "IoSC's React Bootcamp was a hands-on learning experience where students dove into the world of modern web development. From building dynamic UIs to understanding React hooks and components, participants gained practical skills and built their very first React apps. The bootcamp focused on practical learning where students coded along and made it a success.",
    "searchable_text": "React Boot Camp Event IoSC's React Bootcamp was a hands-on learning experience where students dove into the world of modern web development. From building dynamic UIs to understanding React hooks and components, participants gained practical skills and built their very first React apps React Bootcamp web development hands-on learning UI React hooks components practical skills events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_015_1",
    "title": "React Boot Camp Event",
    "content": "The bootcamp focused on practical learning where students coded along and made it a success",
    "category": "events",
    "tags": [
      "React Bootcamp",
      "web development",
      "hands-on learning",
      "UI",
      "React hooks",
      "components",
      "practical skills"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "IoSC's React Bootcamp was a hands-on learning experience where students dove into the world of modern web development. From building dynamic UIs to understanding React hooks and components, participants gained practical skills and built their very first React apps. The bootcamp focused on practical learning where students coded along and made it a success.",
    "searchable_text": "React Boot Camp Event The bootcamp focused on practical learning where students coded along and made it a success React Bootcamp web development hands-on learning UI React hooks components practical skills events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_016_0",
    "title": "Azintek Tech Fest",
    "content": "Azintek marked a major milestone as IoSC's first-ever tech fest, bringing together innovation, creativity, and pure tech energy under one roof",
    "category": "events",
    "tags": [
      "Azintek",
      "tech fest",
      "hackathon",
      "designathon",
      "coding competitions",
      "gaming",
      "global speaker",
      "musical eve"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Azintek marked a major milestone as IoSC's first-ever tech fest, bringing together innovation, creativity, and pure tech energy under one roof. The fest featured an action-packed lineup including a high-stakes Hackathon, an inspiring Designathon, intense Coding Competitions, thrilling Gaming Events, and engaging sessions with a Global Speaker. The night wrapped up with a Musical Eve that kept the vibes alive long after the code stopped compiling.",
    "searchable_text": "Azintek Tech Fest Azintek marked a major milestone as IoSC's first-ever tech fest, bringing together innovation, creativity, and pure tech energy under one roof Azintek tech fest hackathon designathon coding competitions gaming global speaker musical eve events",
    "chunk_index": 0,
    "total_chunks": 3
  },
  {
    "id": "iosc_016_1",
    "title": "Azintek Tech Fest",
    "content": "The fest featured an action-packed lineup including a high-stakes Hackathon, an inspiring Designathon, intense Coding Competitions, thrilling Gaming Events, and engaging sessions with a Global Speaker",
    "category": "events",
    "tags": [
      "Azintek",
      "tech fest",
      "hackathon",
      "designathon",
      "coding competitions",
      "gaming",
      "global speaker",
      "musical eve"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Azintek marked a major milestone as IoSC's first-ever tech fest, bringing together innovation, creativity, and pure tech energy under one roof. The fest featured an action-packed lineup including a high-stakes Hackathon, an inspiring Designathon, intense Coding Competitions, thrilling Gaming Events, and engaging sessions with a Global Speaker. The night wrapped up with a Musical Eve that kept the vibes alive long after the code stopped compiling.",
    "searchable_text": "Azintek Tech Fest The fest featured an action-packed lineup including a high-stakes Hackathon, an inspiring Designathon, intense Coding Competitions, thrilling Gaming Events, and engaging sessions with a Global Speaker Azintek tech fest hackathon designathon coding competitions gaming global speaker musical eve events",
    "chunk_index": 1,
    "total_chunks": 3
  },
  {
    "id": "iosc_016_2",
    "title": "Azintek Tech Fest",
    "content": "The night wrapped up with a Musical Eve that kept the vibes alive long after the code stopped compiling",
    "category": "events",
    "tags": [
      "Azintek",
      "tech fest",
      "hackathon",
      "designathon",
      "coding competitions",
      "gaming",
      "global speaker",
      "musical eve"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Azintek marked a major milestone as IoSC's first-ever tech fest, bringing together innovation, creativity, and pure tech energy under one roof. The fest featured an action-packed lineup including a high-stakes Hackathon, an inspiring Designathon, intense Coding Competitions, thrilling Gaming Events, and engaging sessions with a Global Speaker. The night wrapped up with a Musical Eve that kept the vibes alive long after the code stopped compiling.",
    "searchable_text": "Azintek Tech Fest The night wrapped up with a Musical Eve that kept the vibes alive long after the code stopped compiling Azintek tech fest hackathon designathon coding competitions gaming global speaker musical eve events",
    "chunk_index": 2,
    "total_chunks": 3
  },
  {
    "id": "iosc_017_0",
    "title": "Intel Dev Cloud Session",
    "content": "As part of IoSC's learning series, an interactive session on Intel DevCloud was hosted where students explored the fundamentals of cloud computing and got hands-on experience with Intel's powerful cloud platform",
    "category": "events",
    "tags": [
      "Intel DevCloud",
      "cloud computing",
      "AI models",
      "edge-to-cloud",
      "hands-on experience",
      "learning series"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "As part of IoSC's learning series, an interactive session on Intel DevCloud was hosted where students explored the fundamentals of cloud computing and got hands-on experience with Intel's powerful cloud platform. From deploying AI models to understanding edge-to-cloud workflows, participants gained practical insights into real-world applications of cloud technology.",
    "searchable_text": "Intel Dev Cloud Session As part of IoSC's learning series, an interactive session on Intel DevCloud was hosted where students explored the fundamentals of cloud computing and got hands-on experience with Intel's powerful cloud platform Intel DevCloud cloud computing AI models edge-to-cloud hands-on experience learning series events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_017_1",
    "title": "Intel Dev Cloud Session",
    "content": "From deploying AI models to understanding edge-to-cloud workflows, participants gained practical insights into real-world applications of cloud technology",
    "category": "events",
    "tags": [
      "Intel DevCloud",
      "cloud computing",
      "AI models",
      "edge-to-cloud",
      "hands-on experience",
      "learning series"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "As part of IoSC's learning series, an interactive session on Intel DevCloud was hosted where students explored the fundamentals of cloud computing and got hands-on experience with Intel's powerful cloud platform. From deploying AI models to understanding edge-to-cloud workflows, participants gained practical insights into real-world applications of cloud technology.",
    "searchable_text": "Intel Dev Cloud Session From deploying AI models to understanding edge-to-cloud workflows, participants gained practical insights into real-world applications of cloud technology Intel DevCloud cloud computing AI models edge-to-cloud hands-on experience learning series events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_018_0",
    "title": "Shark Tank Event",
    "content": "In IoSC's Shark Tank event, students stepped into the spotlight to pitch their innovative ideas to a panel of judges. From tech startups to creative solutions for real-world problems, the event was a showcase of entrepreneurial spirit, critical thinking, and bold vision",
    "category": "events",
    "tags": [
      "Shark Tank",
      "pitching",
      "entrepreneurial",
      "startups",
      "innovation",
      "critical thinking",
      "judges"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "In IoSC's Shark Tank event, students stepped into the spotlight to pitch their innovative ideas to a panel of judges. From tech startups to creative solutions for real-world problems, the event was a showcase of entrepreneurial spirit, critical thinking, and bold vision. It was inspiring to see young minds turn ideas into impactful pitches.",
    "searchable_text": "Shark Tank Event In IoSC's Shark Tank event, students stepped into the spotlight to pitch their innovative ideas to a panel of judges. From tech startups to creative solutions for real-world problems, the event was a showcase of entrepreneurial spirit, critical thinking, and bold vision Shark Tank pitching entrepreneurial startups innovation critical thinking judges events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_018_1",
    "title": "Shark Tank Event",
    "content": "It was inspiring to see young minds turn ideas into impactful pitches",
    "category": "events",
    "tags": [
      "Shark Tank",
      "pitching",
      "entrepreneurial",
      "startups",
      "innovation",
      "critical thinking",
      "judges"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "In IoSC's Shark Tank event, students stepped into the spotlight to pitch their innovative ideas to a panel of judges. From tech startups to creative solutions for real-world problems, the event was a showcase of entrepreneurial spirit, critical thinking, and bold vision. It was inspiring to see young minds turn ideas into impactful pitches.",
    "searchable_text": "Shark Tank Event It was inspiring to see young minds turn ideas into impactful pitches Shark Tank pitching entrepreneurial startups innovation critical thinking judges events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_019_0",
    "title": "Student of the Year Award",
    "content": "IoSC's Student of the Year award celebrated a well-rounded achiever who excelled not just in coding and technical skills, but also in leadership, creativity, and extracurricular involvement",
    "category": "events",
    "tags": [
      "Student of the Year",
      "award",
      "excellence",
      "leadership",
      "creativity",
      "extracurricular",
      "role model"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "IoSC's Student of the Year award celebrated a well-rounded achiever who excelled not just in coding and technical skills, but also in leadership, creativity, and extracurricular involvement. This recognition highlights the spirit of all-round excellence where passion for tech meets dedication beyond the screen. A true role model for the community.",
    "searchable_text": "Student of the Year Award IoSC's Student of the Year award celebrated a well-rounded achiever who excelled not just in coding and technical skills, but also in leadership, creativity, and extracurricular involvement Student of the Year award excellence leadership creativity extracurricular role model events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_019_1",
    "title": "Student of the Year Award",
    "content": "This recognition highlights the spirit of all-round excellence where passion for tech meets dedication beyond the screen. A true role model for the community",
    "category": "events",
    "tags": [
      "Student of the Year",
      "award",
      "excellence",
      "leadership",
      "creativity",
      "extracurricular",
      "role model"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "IoSC's Student of the Year award celebrated a well-rounded achiever who excelled not just in coding and technical skills, but also in leadership, creativity, and extracurricular involvement. This recognition highlights the spirit of all-round excellence where passion for tech meets dedication beyond the screen. A true role model for the community.",
    "searchable_text": "Student of the Year Award This recognition highlights the spirit of all-round excellence where passion for tech meets dedication beyond the screen. A true role model for the community Student of the Year award excellence leadership creativity extracurricular role model events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_020_0",
    "title": "Vespera'24 Tech Fest",
    "content": "Vespera, IoSC's second annual tech fest, was spectacular and went bigger and bolder than the first edition. The fest featured a thrilling Hackathon, creative Designathon, thought-provoking Case Study competition, and a unique Filmmaking Challenge",
    "category": "events",
    "tags": [
      "Vespera'24",
      "annual tech fest",
      "hackathon",
      "designathon",
      "case study",
      "filmmaking",
      "treasure hunt",
      "stand-up comedy"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Vespera, IoSC's second annual tech fest, was spectacular and went bigger and bolder than the first edition. The fest featured a thrilling Hackathon, creative Designathon, thought-provoking Case Study competition, and a unique Filmmaking Challenge. The fest also included an adventurous Treasure Hunt and an unforgettable Stand-up Comedy Night that had the crowd in splits.",
    "searchable_text": "Vespera'24 Tech Fest Vespera, IoSC's second annual tech fest, was spectacular and went bigger and bolder than the first edition. The fest featured a thrilling Hackathon, creative Designathon, thought-provoking Case Study competition, and a unique Filmmaking Challenge Vespera'24 annual tech fest hackathon designathon case study filmmaking treasure hunt stand-up comedy events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_020_1",
    "title": "Vespera'24 Tech Fest",
    "content": "The fest also included an adventurous Treasure Hunt and an unforgettable Stand-up Comedy Night that had the crowd in splits",
    "category": "events",
    "tags": [
      "Vespera'24",
      "annual tech fest",
      "hackathon",
      "designathon",
      "case study",
      "filmmaking",
      "treasure hunt",
      "stand-up comedy"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Vespera, IoSC's second annual tech fest, was spectacular and went bigger and bolder than the first edition. The fest featured a thrilling Hackathon, creative Designathon, thought-provoking Case Study competition, and a unique Filmmaking Challenge. The fest also included an adventurous Treasure Hunt and an unforgettable Stand-up Comedy Night that had the crowd in splits.",
    "searchable_text": "Vespera'24 Tech Fest The fest also included an adventurous Treasure Hunt and an unforgettable Stand-up Comedy Night that had the crowd in splits Vespera'24 annual tech fest hackathon designathon case study filmmaking treasure hunt stand-up comedy events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_021_0",
    "title": "Bhasha Bandhu Event",
    "content": "Bhasha Bandhu was a platform where students passionately pitched their ideas, blending innovation with impactful communication. The event encouraged participants to express their thoughts clearly and confidently, regardless of language, celebrating the power of ideas across cultures and dialects",
    "category": "events",
    "tags": [
      "Bhasha Bandhu",
      "pitching",
      "communication",
      "innovation",
      "multilingual",
      "cultural diversity",
      "expression"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Bhasha Bandhu was a platform where students passionately pitched their ideas, blending innovation with impactful communication. The event encouraged participants to express their thoughts clearly and confidently, regardless of language, celebrating the power of ideas across cultures and dialects. It was about breaking barriers through expression and amplifying student voices.",
    "searchable_text": "Bhasha Bandhu Event Bhasha Bandhu was a platform where students passionately pitched their ideas, blending innovation with impactful communication. The event encouraged participants to express their thoughts clearly and confidently, regardless of language, celebrating the power of ideas across cultures and dialects Bhasha Bandhu pitching communication innovation multilingual cultural diversity expression events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_021_1",
    "title": "Bhasha Bandhu Event",
    "content": "It was about breaking barriers through expression and amplifying student voices",
    "category": "events",
    "tags": [
      "Bhasha Bandhu",
      "pitching",
      "communication",
      "innovation",
      "multilingual",
      "cultural diversity",
      "expression"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Bhasha Bandhu was a platform where students passionately pitched their ideas, blending innovation with impactful communication. The event encouraged participants to express their thoughts clearly and confidently, regardless of language, celebrating the power of ideas across cultures and dialects. It was about breaking barriers through expression and amplifying student voices.",
    "searchable_text": "Bhasha Bandhu Event It was about breaking barriers through expression and amplifying student voices Bhasha Bandhu pitching communication innovation multilingual cultural diversity expression events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_022_0",
    "title": "Git-Together Open Source Initiative",
    "content": "Git Together is IoSC's open-source project initiative in collaboration with LLMWare, aimed at bringing students into the world of real-world development",
    "category": "events",
    "tags": [
      "Git Together",
      "open source",
      "LLMWare",
      "collaboration",
      "LLMs",
      "Git",
      "GitHub",
      "real-world development"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Git Together is IoSC's open-source project initiative in collaboration with LLMWare, aimed at bringing students into the world of real-world development. Through this program, students contribute to impactful open-source projects, explore the power of LLMs (Large Language Models), and learn collaborative development using Git and GitHub.",
    "searchable_text": "Git-Together Open Source Initiative Git Together is IoSC's open-source project initiative in collaboration with LLMWare, aimed at bringing students into the world of real-world development Git Together open source LLMWare collaboration LLMs Git GitHub real-world development events",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_022_1",
    "title": "Git-Together Open Source Initiative",
    "content": "Through this program, students contribute to impactful open-source projects, explore the power of LLMs (Large Language Models), and learn collaborative development using Git and GitHub",
    "category": "events",
    "tags": [
      "Git Together",
      "open source",
      "LLMWare",
      "collaboration",
      "LLMs",
      "Git",
      "GitHub",
      "real-world development"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "events",
      "content_type": "text/plain"
    },
    "full_content": "Git Together is IoSC's open-source project initiative in collaboration with LLMWare, aimed at bringing students into the world of real-world development. Through this program, students contribute to impactful open-source projects, explore the power of LLMs (Large Language Models), and learn collaborative development using Git and GitHub.",
    "searchable_text": "Git-Together Open Source Initiative Through this program, students contribute to impactful open-source projects, explore the power of LLMs (Large Language Models), and learn collaborative development using Git and GitHub Git Together open source LLMWare collaboration LLMs Git GitHub real-world development events",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "id": "iosc_023_0",
    "title": "IoSC Contact Information",
    "content": "You can reach IoSC through multiple channels. Email us at iosc. edc@gmail. com for general inquiries and collaboration opportunities. Follow us on social media @iosc_edc for updates and announcements. You can also connect with us on LinkedIn @iosc-usar",
    "category": "contact",
    "tags": [
      "contact",
      "email",
      "iosc.edc@gmail.com",
      "social media",
      "@iosc_edc",
      "@iosc-usar",
      "LinkedIn"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "contact",
      "content_type": "text/plain"
    },
    "full_content": "You can reach IoSC through multiple channels. Email us at iosc.edc@gmail.com for general inquiries and collaboration opportunities. Follow us on social media @iosc_edc for updates and announcements. You can also connect with us on LinkedIn @iosc-usar. We're always open to connecting with students, alumni, and industry professionals interested in technology and innovation.",
    "searchable_text": "IoSC Contact Information You can reach IoSC through multiple channels. Email us at iosc. edc@gmail. com for general inquiries and collaboration opportunities. Follow us on social media @iosc_edc for updates and announcements. You can also connect with us on LinkedIn @iosc-usar contact email iosc.edc@gmail.com social media @iosc_edc @iosc-usar LinkedIn contact",
    "chunk_index": 0,
    "total_chunks": 2
  },
  {
    "id": "iosc_023_1",
    "title": "IoSC Contact Information",
    "content": "We're always open to connecting with students, alumni, and industry professionals interested in technology and innovation",
    "category": "contact",
    "tags": [
      "contact",
      "email",
      "iosc.edc@gmail.com",
      "social media",
      "@iosc_edc",
      "@iosc-usar",
      "LinkedIn"
    ],
    "url": "internal_document",
    "metadata": {
      "author": "IoSC",
      "section": "contact",
      "content_type": "text/plain"
    },
    "full_content": "You can reach IoSC through multiple channels. Email us at iosc.edc@gmail.com for general inquiries and collaboration opportunities. Follow us on social media @iosc_edc for updates and announcements. You can also connect with us on LinkedIn @iosc-usar. We're always open to connecting with students, alumni, and industry professionals interested in technology and innovation.",
    "searchable_text": "IoSC Contact Information We're always open to connecting with students, alumni, and industry professionals interested in technology and innovation contact email iosc.edc@gmail.com social media @iosc_edc @iosc-usar LinkedIn contact",
    "chunk_index": 1,
    "total_chunks": 2
  }
]